## Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

1. Series


2. DataFrame


3. Missing Data


4. GroupBy


5. Merging, Joining, Concatenating


6. Operations


7. Data Input and Output

#### Pandas Series

Series is similar to Numpy array. Difference between a series and a numpy array is that a series can have axis labels.

In [1]:
import numpy as np
import pandas as pd

### Create Series using numpy arrays, list, or dictionary

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([100,200,300])
d = {'a':10,'b':20,'c':30}

##### Using lists

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

##### Using numpy arrays

In [5]:
pd.Series(arr,labels)

a    100
b    200
c    300
dtype: int64

##### Using dictionary

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

##### Type of data

In [7]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

##### Using index

In [8]:
ser1 = pd.Series([1,2,3,4],index=['Sushil','Gaurav','Bhagyalaxmi','Ankita'])
ser2 = pd.Series([21,22,23,24],index=['Sushil','Gaurav','Bhagyalaxmi','Viplav'])

In [9]:
ser1

Sushil         1
Gaurav         2
Bhagyalaxmi    3
Ankita         4
dtype: int64

In [10]:
ser2

Sushil         21
Gaurav         22
Bhagyalaxmi    23
Viplav         24
dtype: int64

In [11]:
ser1+ser2

Ankita          NaN
Bhagyalaxmi    26.0
Gaurav         24.0
Sushil         22.0
Viplav          NaN
dtype: float64

In [12]:
ser1['Gaurav']

2

#### Dataframes

In [13]:
!git add --all

In [14]:
!git commit -m "pandas"

[master d71d798] pandas
 1 file changed, 12 insertions(+), 10 deletions(-)

### Dataframes

#### Dataframe is a workhorse of pandas and is directly inspired by R.

In [15]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A -0.476757 -0.241681 -0.727437  0.484378
B  1.143756 -0.025936 -0.628773  0.834933
C  0.491090 -0.398178  0.737334  0.092209
D  1.782505  1.620772  0.399676 -0.165660
E  1.414397 -0.380957 -0.221823 -0.987242

In [18]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

##### Selection and Indexing

In [25]:
df['W'] # Recommended syntax

A   -0.476757
B    1.143756
C    0.491090
D    1.782505
E    1.414397
Name: W, dtype: float64

In [24]:
df.W # SQL Syntax - Not recommended

A   -0.476757
B    1.143756
C    0.491090
D    1.782505
E    1.414397
Name: W, dtype: float64

In [21]:
df[['W','Z']]

          W         Z
A -0.476757  0.484378
B  1.143756  0.834933
C  0.491090  0.092209
D  1.782505 -0.165660
E  1.414397 -0.987242

In [26]:
type(df['W'])

pandas.core.series.Series

In [38]:
df['sum']=df['W']+df['X']

In [29]:
df

          W         X         Y         Z       sum
A -0.476757 -0.241681 -0.727437  0.484378 -0.718438
B  1.143756 -0.025936 -0.628773  0.834933  1.117820
C  0.491090 -0.398178  0.737334  0.092209  0.092912
D  1.782505  1.620772  0.399676 -0.165660  3.403277
E  1.414397 -0.380957 -0.221823 -0.987242  1.033440

In [30]:
df['sum']

A   -0.718438
B    1.117820
C    0.092912
D    3.403277
E    1.033440
Name: sum, dtype: float64

In [31]:
df.sum

<bound method DataFrame.sum of           W         X         Y         Z       sum
A -0.476757 -0.241681 -0.727437  0.484378 -0.718438
B  1.143756 -0.025936 -0.628773  0.834933  1.117820
C  0.491090 -0.398178  0.737334  0.092209  0.092912
D  1.782505  1.620772  0.399676 -0.165660  3.403277
E  1.414397 -0.380957 -0.221823 -0.987242  1.033440>

#### Remove colums

In [33]:
df.drop('sum',axis=1)

          W         X         Y         Z
A -0.476757 -0.241681 -0.727437  0.484378
B  1.143756 -0.025936 -0.628773  0.834933
C  0.491090 -0.398178  0.737334  0.092209
D  1.782505  1.620772  0.399676 -0.165660
E  1.414397 -0.380957 -0.221823 -0.987242

In [34]:
df

          W         X         Y         Z       sum
A -0.476757 -0.241681 -0.727437  0.484378 -0.718438
B  1.143756 -0.025936 -0.628773  0.834933  1.117820
C  0.491090 -0.398178  0.737334  0.092209  0.092912
D  1.782505  1.620772  0.399676 -0.165660  3.403277
E  1.414397 -0.380957 -0.221823 -0.987242  1.033440

In [35]:
df.drop('sum',axis=1,inplace=True)

In [39]:
df

          W         X         Y         Z       sum
A -0.476757 -0.241681 -0.727437  0.484378 -0.718438
B  1.143756 -0.025936 -0.628773  0.834933  1.117820
C  0.491090 -0.398178  0.737334  0.092209  0.092912
D  1.782505  1.620772  0.399676 -0.165660  3.403277
E  1.414397 -0.380957 -0.221823 -0.987242  1.033440

In [40]:
df.drop('sum',axis=1)

          W         X         Y         Z
A -0.476757 -0.241681 -0.727437  0.484378
B  1.143756 -0.025936 -0.628773  0.834933
C  0.491090 -0.398178  0.737334  0.092209
D  1.782505  1.620772  0.399676 -0.165660
E  1.414397 -0.380957 -0.221823 -0.987242

In [41]:
df

          W         X         Y         Z       sum
A -0.476757 -0.241681 -0.727437  0.484378 -0.718438
B  1.143756 -0.025936 -0.628773  0.834933  1.117820
C  0.491090 -0.398178  0.737334  0.092209  0.092912
D  1.782505  1.620772  0.399676 -0.165660  3.403277
E  1.414397 -0.380957 -0.221823 -0.987242  1.033440

In [42]:
df = df.drop('sum',axis=1)
df

          W         X         Y         Z
A -0.476757 -0.241681 -0.727437  0.484378
B  1.143756 -0.025936 -0.628773  0.834933
C  0.491090 -0.398178  0.737334  0.092209
D  1.782505  1.620772  0.399676 -0.165660
E  1.414397 -0.380957 -0.221823 -0.987242

#### Selecting rows

In [43]:
df.loc['A']

W   -0.476757
X   -0.241681
Y   -0.727437
Z    0.484378
Name: A, dtype: float64

In [46]:
df.iloc[0]

W   -0.476757
X   -0.241681
Y   -0.727437
Z    0.484378
Name: A, dtype: float64

In [47]:
df.loc[['A','B'],['W','Z']]

          W         Z
A -0.476757  0.484378
B  1.143756  0.834933

##### Conditional selection

In [48]:
df

          W         X         Y         Z
A -0.476757 -0.241681 -0.727437  0.484378
B  1.143756 -0.025936 -0.628773  0.834933
C  0.491090 -0.398178  0.737334  0.092209
D  1.782505  1.620772  0.399676 -0.165660
E  1.414397 -0.380957 -0.221823 -0.987242

In [49]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True  False  False   True
C   True  False   True   True
D   True   True   True  False
E   True  False  False  False

In [50]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.484378
B  1.143756       NaN       NaN  0.834933
C  0.491090       NaN  0.737334  0.092209
D  1.782505  1.620772  0.399676       NaN
E  1.414397       NaN       NaN       NaN

In [51]:
df[df>0]['Z']

A    0.484378
B    0.834933
C    0.092209
D         NaN
E         NaN
Name: Z, dtype: float64

In [52]:
countries = 'USA China India UK Scotland'.split()
countries

['USA', 'China', 'India', 'UK', 'Scotland']

In [53]:
df['countries']=countries

In [54]:
df

          W         X         Y         Z countries
A -0.476757 -0.241681 -0.727437  0.484378       USA
B  1.143756 -0.025936 -0.628773  0.834933     China
C  0.491090 -0.398178  0.737334  0.092209     India
D  1.782505  1.620772  0.399676 -0.165660        UK
E  1.414397 -0.380957 -0.221823 -0.987242  Scotland

In [55]:
df.set_index('countries')

                  W         X         Y         Z
countries
USA       -0.476757 -0.241681 -0.727437  0.484378
China      1.143756 -0.025936 -0.628773  0.834933
India      0.491090 -0.398178  0.737334  0.092209
UK         1.782505  1.620772  0.399676 -0.165660
Scotland   1.414397 -0.380957 -0.221823 -0.987242

### Multi Index

In [56]:
outside = 'India India US US China China'.split()

inside = 'HR TN CA AZ XI WU'.split()

In [57]:
outside

['India', 'India', 'US', 'US', 'China', 'China']

In [58]:
inside

['HR', 'TN', 'CA', 'AZ', 'XI', 'WU']

In [59]:
hidx = list(zip(outside,inside))
hidx

[('India', 'HR'),
 ('India', 'TN'),
 ('US', 'CA'),
 ('US', 'AZ'),
 ('China', 'XI'),
 ('China', 'WU')]

In [61]:
hidx = pd.MultiIndex.from_tuples(hidx)
hidx

MultiIndex([('India', 'HR'),
            ('India', 'TN'),
            (   'US', 'CA'),
            (   'US', 'AZ'),
            ('China', 'XI'),
            ('China', 'WU')],
           )

In [62]:
df = pd.DataFrame(np.random.randn(6,2),index=hidx,columns=['Total','Recovered'])

In [63]:
df

             Total  Recovered
India HR -1.253166  -1.194912
      TN -0.680913   0.772337
US    CA  1.200627   0.582862
      AZ -1.068673  -1.262494
China XI  0.206313  -0.560809
      WU -0.326789   0.840547

In [64]:
df.loc['India']

       Total  Recovered
HR -1.253166  -1.194912
TN -0.680913   0.772337

In [65]:
df.loc['US'].loc['AZ']

Total       -1.068673
Recovered   -1.262494
Name: AZ, dtype: float64

In [66]:
df.index.names

FrozenList([None, None])

In [67]:
df.index.names = ['Countries','States']

In [68]:
df

                     Total  Recovered
Countries States
India     HR     -1.253166  -1.194912
          TN     -0.680913   0.772337
US        CA      1.200627   0.582862
          AZ     -1.068673  -1.262494
China     XI      0.206313  -0.560809
          WU     -0.326789   0.840547

#### Missing Data

In [70]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [72]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [73]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [74]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [75]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [76]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

##### GroupBy

In [77]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','GOOG','MSFT'],
       'Person':['Kalyan','Vipul','Sonam','Gaurav','Viplav','Jorge'],
       'Sales':[200,1200,1302,3023,723,232]}

In [78]:
df = pd.DataFrame(data)
df

  Company  Person  Sales
0    GOOG  Kalyan    200
1    GOOG   Vipul   1200
2    MSFT   Sonam   1302
3    MSFT  Gaurav   3023
4    GOOG  Viplav    723
5    MSFT   Jorge    232

In [80]:
byCompany = df.groupby('Company')

In [81]:
byCompany.mean()

               Sales
Company
GOOG      707.666667
MSFT     1519.000000

#### Operations

In [82]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [83]:
df['col2'].unique()

array([444, 555, 666])

In [84]:
df['col2'].nunique()

3

In [85]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [86]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [90]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df=pd.DataFrame(data)

df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [93]:
df.pivot_table(values='D',index=['A','B'],aggfunc='sum')#,columns=['C'])

         D
A   B
bar one  5
    two  5
foo one  4
    two  2

In [95]:
df.pivot_table(values='D', index=['A','B'], aggfunc='sum')#, columns=['C','D'])

         D
A   B
bar one  5
    two  5
foo one  4
    two  2

#### CSV

In [96]:
ls

Numpy.ipynb   abc.xlsx      embedded.png
Pandas.ipynb  dataset/      example9.csv

In [98]:
df = pd.read_csv('example9.csv')

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [99]:
df.head(10)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106
5  Afghanistan  1977  14880372.0      Asia   38.438  786.113360
6  Afghanistan  1982  12881816.0      Asia   39.854  978.011439
7  Afghanistan  1987  13867957.0      Asia   40.822  852.395945
8  Afghanistan  1992  16317921.0      Asia   41.674  649.341395
9  Afghanistan  1997  22227415.0      Asia   41.763  635.341351

In [100]:
df['machinelearning'] ='yes'

In [101]:
df

,country,year,pop,continent,lifeExp,gdpPercap,machinelearning
0,Afghanistan,1952,8425333.0,Asia,28.801,779.445314,yes
1,Afghanistan,1957,9240934.0,Asia,30.332,820.853030,yes
2,Afghanistan,1962,10267083.0,Asia,31.997,853.100710,yes
3,Afghanistan,1967,11537966.0,Asia,34.020,836.197138,yes
4,Afghanistan,1972,13079460.0,Asia,36.088,739.981106,yes
...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418.0,Africa,62.351,706.157306,yes
1700,Zimbabwe,1992,10704340.0,Africa,60.377,693.420786,yes
1701,Zimbabwe,1997,11404948.0,Africa,46.809,792.449960,yes
1702,Zimbabwe,2002,11926563.0,Africa,39.989,672.038623,yes
1703,Zimbabwe,2007,12311143.0,Africa,43.487,469.709298,yes

In [102]:
df.to_csv('dump.csv')

In [103]:
ls

Numpy.ipynb   abc.xlsx      dump.csv      example9.csv
Pandas.ipynb  dataset/      embedded.png

In [107]:
df = pd.read_excel('abc.xlsx',sheet_name='Sheet1')

In [108]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [109]:
df.to_excel('dumpxl.xlsx',sheet_name='Sheet1')

In [110]:
ls

Numpy.ipynb   abc.xlsx      dump.csv      embedded.png
Pandas.ipynb  dataset/      dumpxl.xlsx   example9.csv

In [111]:
df = pd.read_html('https://www.fdic.gov/Bank/individual/failed/banklist.html')

In [113]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [114]:
from sqlalchemy import create_engine

In [115]:
engine = create_engine('sqlite:///:memory:')

# Pending